"file.untitled" = "Sans titre";

"menu.about" = "À propos de RightClick+";
"menu.version" = "Version %@";
"menu.plan.free" = "Plan : Gratuit";
"menu.plan.pro" = "Plan : Pro ✓";
"menu.checkForUpdates" = "Rechercher des mises à jour…";

"upgrade.title" = "Passer à Pro";
"upgrade.subtitle" = "Débloquez toutes les fonctionnalités de RightClick+";
"upgrade.feat1" = "✓  Couper et coller des fichiers dans le Finder";
"upgrade.feat2" = "✓  Formats Office et Apple (docx, xlsx, pptx, pages…)";
"upgrade.feat3" = "✓  Fonctionnalités et mises à jour futures";
"upgrade.monthly" = "1 $ / mois";
"upgrade.annual" = "11 $ / an  (économisez 58 %)";
"upgrade.buy" = "Obtenir Pro →";
"upgrade.key_placeholder" = "Clé de licence  (XXXX-XXXX-XXXX-XXXX)";
"upgrade.activate" = "Activer";
"upgrade.cancel" = "Peut-être plus tard";

"license.activated" = "🎉 Pro à vie activé ! Merci.";
"license.activated_monthly" = "🎉 Pro mensuel activé ! %d jours restants.";
"license.activated_annual" = "🎉 Pro annuel activé ! %d jours restants.";
"license.invalid_format" = "Format invalide. Utilisez XXXX-XXXX-XXXX-XXXX.";
"license.invalid_key" = "Clé introuvable. Vérifiez votre e-mail.";
"license.expired" = "Votre licence a expiré. Veuillez la renouveler.";

"license.expiry.soon.title" = "Votre licence expire dans %d jour(s)";
"license.expiry.soon.body" = "Renouvelez maintenant pour conserver toutes les fonctionnalités Pro sans interruption.";
"license.expiry.today.title" = "Votre licence expire aujourd'hui";
"license.expiry.today.body" = "Renouvelez maintenant pour ne pas perdre l'accès aux fonctionnalités Pro.";
"license.expiry.renew" = "Renouveler →";
"license.expiry.dismiss" = "Me rappeler plus tard";

"menu.plan.monthly" = "Plan : Pro mensuel ✓ (%d jours restants)";
"menu.plan.annual" = "Plan : Pro annuel ✓ (%d jours restants)";
"menu.plan.lifetime" = "Plan : Pro à vie ✓";

"onboarding.title" = "Bienvenue dans RightClick+";
"onboarding.subtitle" = "Deux étapes rapides pour commencer";
"onboarding.step1.title" = "Activer l'extension Finder";
"onboarding.step1.detail" = "Une fenêtre système s'ouvrira. Cochez la case à côté de RightClick+ pour l'activer.";
"onboarding.step1.done" = "✓ Extension Finder active.";
"onboarding.step2.title" = "Autoriser le renommage automatique";
"onboarding.step2.detail" = "Accordez l'accès Accessibilité dans les Réglages Système pour que les nouveaux fichiers soient prêts à renommer.";
"onboarding.step2.done" = "✓ Renommage automatique activé.";
"onboarding.btn.step1" = "Étape 1 : Activer l'extension →";
"onboarding.btn.step2" = "Étape 2 : Autoriser le renommage →";
"onboarding.btn.done" = "C'est fait — Fermer";
"onboarding.skip" = "Je le ferai plus tard";
